clc
clear

%% 1
A = [6 -1 -1; 1 -2 3; 3 4 4];
B = [0; 1; -1];

fprintf('Решение методом обратной матрицы:\n');
x = inv(A) * B; % Решение методом обратной матрицы
disp(x)

fprintf('проверяем условие B-Ax=0:\n');
check = B-A*x;
disp(check)

%% 2

A = [
    9.1 5.6 7.8; 
    3.8 5.1 2.8; 
    4.1 5.7 1.2
    ];
B = [9.8; 6.7; 5.8];

Ab = [A, B];
R = rref(Ab);

fprintf('Решение методом Гаусса-Жордана:\n');
x = R(:, end);
disp(x);

fprintf('проверяем условие B-Ax=0:\n');
check = B-A*x;
disp(check);
fprintf('очень близко к нулю\n');

%% 3

A = [
    2.34 -1.42 -0.54 0.21;
    1.44 -0.53 1.43 -1.27;
    0.63 -1.32 -0.65 1.43;
    0.54 0.88 -0.67 -2.38;
];

B = [0.66; -1.44; 0.94; 0.73]

[L, U] = lu(A);
% Решение системы эквивалентно последовательному решению двух треугольных систем:
% L*y = b  и  U*x = y
fprintf('Решение через LU-разложение:\n');
x = U \ (L \ B);
disp(x);

fprintf('проверяем условие B-Ax=0:\n');
check = B-A*x;
disp(check);
fprintf('очень близко к нулю\n');


%% 4


A = [
%   Ca P  N  H  O  F
    5  3  0  0  12 1; % Ca5F(PO4)3;
    0  0  1  1  3  0; % HNO3;
    1  0  2  0  6  0; % Ca(NO3)2;
    0  1  0  3  4  0; % H3PO4;
    0  0  0  1  0  1; % HF;
    1  0  0  0  1  0; % CaO;
    0  0  0  2  1  0; % H2O
];

% Находим вектор стехиометрических коэффициентов
B = null(A', 'r');

disp('Матрица стехиометрических коэффициентов B:');
disp(B);
