# 64. C3H7S (PropylThiol) + 6 O2 = 3 CO2 + 4 H2O + SO2

import numpy as np


PropylThiol = [
    9.44634005E+00,
    1.81966887E-02,
    -6.56090105E-06,
    1.05822368E-09,
    -6.32704728E-14,
    4.61400889E+03,
    -2.20499216E+01
]

O2 = [
    3.66096065E+00,
    6.56365811E-04,
    -1.41149627E-07,
    2.05797935E-11,
    -1.29913436E-15,
    -1.21597718E+03,
    3.41536279E+00,
]

CO2 = [
    0.46365111E+01,
    0.27414569E-02,
    -0.99589759E-06,
    0.16038666E-09,
    -0.91619857E-14,
    -0.49024904E+05,
    -0.19348955E+01,
]

H2O = [
    4.17228741E+00,
    1.88117627E-03,
    -3.46277286E-07,
    1.94657549E-11,
    1.76256905E-16,
    3.10206839E+01,
    2.95767672E+00,
]

SO2 = [
    5.38423482E+00,
    1.67930560E-03,
    -6.32062944E-07,
    1.08465348E-10,
    -6.66890336E-15,
    -3.76067022E+04,
    -1.83130517E+00
]

R = 8.31446261815324  # Универсальная газовая постоянная в Дж/(моль·К)
T = 340 # Температура в Кельвинах

def Cp(coef, T):
    """
    Расчет абсолютной теплоемкости Cp
    Cp = (a1 + a2*T + a3*T^2 + a4*T^3 + a5*T^4) * R
    """
    cp_terms = (coef[0] + 
            coef[1] * T + 
            coef[2] * T**2 + 
            coef[3] * T**3 + 
            coef[4] * T**4)
    
    return cp_terms * R
    
def H(coef, T):
    """
    Расчет абсолютной энтальпии H в Дж/моль
    H = R * T * [a1 + (a2/2)T + (a3/3)T^2 + (a4/4)T^3 + (a5/5)T^4] + R * a6
    """
    
    h_terms = (coef[0] + 
                (coef[1] / 2) * T + 
                (coef[2] / 3) * T**2 + 
                (coef[3] / 4) * T**3 + 
                (coef[4] / 5) * T**4 + 
                (coef[5] / T))
    
    return R * T * h_terms

def S(coef, T):
    """
    Расчет абсолютной энтропии S в Дж/(моль·К)
    S = R * [a1*ln(T) + a2*T + (a3/2)*T^2 + (a4/3)*T^3 + (a5/4)*T^4] + R * a7
    """
    
    s_terms = (coef[0] * np.log(T) +
                coef[1] * T + 
                (coef[2] / 2) * T**2 + 
                (coef[3] / 3) * T**3 + 
                (coef[4] / 4) * T**4 +
                coef[6])
                
    
    return R * s_terms

print("Теплоемкость C3H7S (PropylThiol) =", Cp(PropylThiol, T))
print("Энтальпия C3H7S (PropylThiol) =", H(PropylThiol, T))
print("Энтропия C3H7S (PropylThiol) =", S(PropylThiol, T))

delta_H = (3 * H(CO2, T) + 4 * H(H2O, T) + H(SO2, T)) - (H(PropylThiol, T) + 6 * H(O2, T))
delta_S = (3 * S(CO2, T) + 4 * S(H2O, T) + S(SO2, T)) - (S(PropylThiol, T) + 6 * S(O2, T))
print("Изменение энтальпии реакции ΔH =", delta_H)
print("Изменение энтропии реакции ΔS =", delta_S)
delta_G = delta_H - T * delta_S
print("Изменение свободной энергии Гиббса ΔG =", delta_G)